START_STRING = "Приветствую! Я бот, созданный для того чтобы проводить игры Тайный Санта"
CANCELED_STRING = "Отмена. Возврат в %s"

ASK_CREATE_CONF_STRING = "Вы выбрали создать игровую комнату, пожалуйста, подтвердите действие"
ASK_ROOM_NAME_STRING = "Введите имя для новой комнаты"
ASK_CONF_ROOM_NAME_STRING = "Игровая комната будет называеться \"%s\". Вы согласны?"
CREATED_STRING = "Игровая комната \"%s\" создана. Чтобы зайти в неё, вашим друзьям понадобится этот ключ:"

JOIN_STRING = "Вы выбрали присоединиться к игровой комнате, пожалуйста, введите ключ игровой комнаты, его вам сообщил организатор"
JOIN_FAILED_STRING = "Присоединение не удалось"
JOIN_SUCCEEDED_STRING = "Вы успешно присоединились к игровой комнате и стали участником игры"

ASK_LEAVE_STRING = "Вы действительно хотите покинуть комнату и перестать быть участником этой игры?"
LEAVE_SUCCEEDED_STRING = "Вы покинули игровую комнату и больше не являетесь участником игры"

CHECK_MY_ROOMS_STRING = "Вот список комнат, в которых в находитесь"
ROOM_LIST_STRING = "Выберите комнату, которую хотите посмотреть:"
PlAYER_LIST_STRING = "Вот список игроков комнаты \"%s\":\n"
ASK_ROOM_DISTRIBUTE_STRING = "Вы действительно хотите провести жеребьёвку?"
ASK_ROOM_DISTRIBUTE_NON_HOST_STRING = "Жеребьёвку может провести только создатель комнаты"
DISTRIBUTE_SUCCEEDED_STRING = "Жеребьёвка для комнаты \"%s\" успешно проведена, каждый участник может узнать о своем подопечном в меню комнаты?"
GET_ACCEPTOR_STRING = "Ваш подопечный — @%s\n%s"
EMPTY_ACCEPTOR_STRING = "Подобечный ещё не определён. Ожидайте жеребьёвки от создателя комнаты"

DELETE_STRING = "Вы выбрали удалить игровую комнату, введите ключ игровой комнаты"
DELETE_SUCCEEDED_STRING = "Вы успешно удалили игровую комнату, участники оповещены"
DELETE_FAILED_STRING = "Удаление не удалось. Возможно, вы не создавали игровую команту или неверно ввели ключ"
