START_STRING = "Приветствую! Я созадан для того чтобы проводить игры Тайный Санта"

CREATE_STRING = "Вы выбрали создать игровую комнату, пожалуйста, подтвердите действие"
CREATE_ACCEPTED_STRING = "Игровая комната создана. Ключ подключения: "
CREATE_CANCELED_STRING = "Вы отменили создание игровой комнаты"

JOIN_STRING = "Вы выбрали присоединиться к игровой комнате, пожалуйста, введите ключ игровой комнаты, его вам сообщил организатор"
JOIN_FAILED_STRING = "Присоединение не удалось. Пожалуйста, проверьте правильность введёного ключа"
JOIN_SUCCEEDED_STRING = "Вы успешно присоединились к игровой комнате и стали участником игры"

LEAVE_STRING = "Вы выбрали покинуть игровую комнату, пожалуйста, введите ключ игровой комнаты из которой хотите выйти"
LEAVE_SUCCEEDED_STRING = "Вы покинули игровую комнату и больше не являетесь участником игры"
LEAVE_FAILED_STRING = "Не удалось покинуть игровую комнату. Пожалуйста, проверьте правильность введёного ключа"

DELETE_STRING = "Вы выбрали удалить игровую комнату, введите ключ игровой комнаты"
DELETE_SUCCEEDED_STRING = "Вы успешно удалили игровую комнату, участники оповещены"
DELETE_FAILED_STRING = "Удаление не удалось. Возможно, вы не создавали игровую команту или неверно ввели ключ"